Reports/Саммит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>Саммит</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Саммит/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		КомандыЗагрузить();
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет.Команды.Выгрузить().ВыгрузитьКолонку("Команда"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандыЗагрузить()
	Если Отчет.Команды.Количество() = 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Команды.Ссылка КАК Команда
		                      |ИЗ
		                      |	Справочник.Команды КАК Команды
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
		                      |			ПО Города.Владелец = Страны.Ссылка
		                      |		ПО Команды.Город = Города.Ссылка
		                      |ГДЕ
		                      |	Команды.Наименование В(&Наименование)
		                      |	И Страны.Код = &Код");
		Запрос.УстановитьПараметр("Наименование",		Разделить("Арсенал,Ливерпуль,Манчестер Сити,Манчестер Юнайтед,Тоттенхэм,Челси", ","));
		Запрос.УстановитьПараметр("Код",				"ENG");
		Отчет.Команды.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сформировать();
КонецПроцедуры
